Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 下船后，他们看到来找他们的人，发现是一名相貌稍显稚嫩的年轻人，出乎意料的是，年轻人的本体正是龟族。
en_us: After disembarking, they saw who had come to find them, and they discovered that it was a young person whose facial features still seemed slightly delicate. Unexpectedly, the young person's body (本体) was that of the Tortoise Clan.

source: 不过很快就有人认出他们，之前因为他们换回原来的容貌，所以知道他们的人很少，但是与妖凰族的姬芮一事却让很多人都知道他们的样子。
en_us: However, they were soon recognized. They had changed back to the original appearance so very few people recognized them, but with the affair with Ji Rui from the Demon Phoenix Clan made many people know what they looked like.

source: 不过最后也没能幸免，因为一时紧张操作失误，结果被一道雷给劈了一下，不仅手脚发麻，头发也都竖起来了，被凌霄给嘲笑了一顿。
en_us: However, he was did not escape unscathed as a bolt of lightning stuck due to an operational error resulting from nervousness. Not only did it cause his hands and feet to feel numb, his hair also stood upright and he was ridiculed by Ling Xiao.

source: 不过由于天公鼎的禁制无法百分之百的保证彩级灵丹不会飞走，所以游小默每次成丹时都要分神注意一下。
en_us: The restriction array of Heavenly Cauldron was unable to give a hundred percent guarantee that a Rainbow Level magic pill would not fly away. Therefore, every time You XiaoMo formed a pill he would have to split some of his attention to monitor it.

source: 不过程向荣的部下就没那么好命了，一对二尤其吃力。
en_us: However, Cheng XiangRong's subordinate weren't having such a good time. It was exceptionally tiring to fight one against two.

source: 不仅如此，眼前这名少年的实力也隐隐在他们之上的样子，他们虽然是奉命守着入口，但若敌不过也没必要死磕。
en_us: Not only that, the young man in front of him felt slightly stronger than them. Just because they were ordered to guard this place, doesn't mean they were going to put their life on the line.

source: 不仅解决了两姐妹，而且还能转移莫玛的注意力。
en_us: Not only did she get rid of the two sisters, but she could also divert Mo Ma's attention.

source: 不住逍遥院的后果就是，每隔一小段时间就会有人找上门来动刀动枪。
en_us: The consequence of not living in XiaoYao Institution was that every once in a while they would have someone come and find them, waving knives and guns.

source: 不出五分钟，水妖就被游小默踩在脚下，四肢被他割断了，一股浓稠的青色液体从伤口处流出来，浸透到土壤里。
en_us: It wasn't even five minutes before the Water Demon was below You XiaoMo's feet and it's limbs severed. A thick, blue-greenish liquid poured out from it's wounds, seeping into the earth.

source: 不出意外，程荷摇摇头，“不能，丹方的主人点明只要一二品彩丹。”
en_us: As per expectations, Cheng He shook her head, "No it can't. The owner of the pill recipe pointed out that they only want a first and second grade rainbow pill."

source: 不到一刻钟，李管事便心满意足的离开了酒楼。
en_us: Not even a moment later, Manager Li left the inn, perfectly satisfied.

source: 不到二十分钟，游小默就走到那条街，街上一如既往的热闹，但是很快就发现不对劲。
en_us: In less than twenty minutes, You XiaoMo was on the street. The street was as busy as usual, but he soon realized that something wasn't right.

source: 不到他说话，另外两名黑衣人立刻拔刀朝他冲了过来，外面照射进来的阳光刚好落在他们脸上，引出两张狰狞的脸庞，挂着青紫的色彩。
en_us: Before he could even speak, the other two men in black charged towards him with their swords. As the outside sunlight shone on their faces, their ferocious features, as well as the bruises, could be seen.

source: 不到几分钟，那个将它抓进来的人立刻放了三只妖兽进来。
en_us: Only a few minutes had passed before the human who had captured him put three demon beasts inside.

source: 不到半个时辰，大家都在老夫妇的房屋外的空地集合。
en_us: Within two hours, everyone was gathered at the empty grounds in front of the old couple's house.

source: 不到半小时，两人便交手数百次。
en_us: In less than half an hour, the two crossed hands hundreds of times.

source: 不可能，他不可能输给一个他看不起的。
en_us: Impossible. It was impossible for him to lose to someone he looked down upon.

source: 不多时，一群水鲨便在变异首领的带领下来到小岛的另一面。
en_us: Not longer after, a group of sharks arrived at the other side of the island under the command of a mutant leader.

source: 不多时，变异首领立刻带着手下败走了。
en_us: Not long after that, the mutant leader fled in defeat with its underlings.

source: 不好意思，他没听到！
en_us: Sorry but he didn't hear it!

source: 不对！
en_us: That's not right!

source: 不带这样人身攻击的！
en_us: Hey, no personal attacks!

source: 不得不说，她有一双毒辣的眼睛，才接触没多久竟然就看出游咏的性格。
en_us: It had to be mentioned that she had a pair of sinister eyes. She was actually able to see through You Yong's temperament even though they had not interacted long.

source: 不得不说，游小默和凌霄真是心有灵犀。
en_us: It really had to be said that You XiaoMo and Ling Xiao were connected.

source: 不怪他怀疑，因为刍云山脉就是游小默和凌霄遇到莫景被邢七和他的同伴追杀而且差点被杀掉的地方。
en_us: It was not surprising that he was suspicious because the ChuYun Mountain Range was where You XiaoMo and Ling Xiao had met Mo Jing, who was being hunted down by Xing Qi and his companions. It was also the place where Mo Jing had nearly been killed.

source: 不想他和小助手刚走出厨房，里面就传出一个愤怒的声音，两人不由得面面相觑。
en_us: What he didn't expect was that, just as they left the kitchen, an angry voice came from within. The two looked at each other quizcally.

source: 不想他还是慢了一步，一道强悍的气势突然从身后肆虐而来，仿佛奔腾的海啸剧烈的翻滚着，声威浩大，把周围的妖兽都给吓走了。
en_us: However, he was still a step too slow. A vigorous (强悍) force suddenly appeared from behind, wrecking havoc along the way, as if a rampaging tsunami. It's force (声威浩大) scared away all of the surrounding demon beasts.

source: 不想这里竟然出现一只十二阶水妖，如果让它逃到通天大陆，怕是用不了多久，通天大陆就会有许多人变成水妖。
en_us: Unexpectedly, a Level Twelve Water Demon actually appeared here. If they let it escape to the TongTian Continent, perhaps it would not be long before many people in the TongTian Continent would turn into Water Demons.

source: 不想，翁公神情突然多了一丝微妙的戒备。
en_us: Unexpectedly, Weng Gong's expression immediately gained a trace of subtle alertness.

source: 不懂得做人的人，就算他的身份地位再高，真正愿意尊敬他们的人绝对没几个人。
en_us: For those who don’t know how to be proper (做人的人), even if his status was high, there wouldn’t be many who truly respected them.

source: 不成想，火花是碰撞出来，过程却只有短短不到五分钟，妖凰族的十二阶强者姬芮却十分干脆的败走了，无异于静水中的重磅炸弹。
en_us: Who would've thought that although sparks did indeed fly, the entire course of events took place during a short five minutes. The Level Twelve expert of the Demon Phoenix Clan, Ji Rui, fled in defeat extremely straight-forwardly, just like a heavyweight bomb in still water.

source: 不是他那就好，不然他们的计划只能取消。
en_us: It's good if it's not him, otherwise they could only cancel their plan.

source: 不是大家要针对他，只不过这是个强者为尊的世界，如果你没有实力，想让别人臣服于你是不可能的，何况是一群桀骜不驯，有实力的强者。
en_us: It was not that everyone was against him. It was just that this was a world where the strong were respected. It was impossible to make others swear allegiance to you if you did not have the strength, let alone a wild and intractable group of strong powerhouses.

source: 不是等于让他的人去送死，这种话说得好听，问题是根本没办法执行。
en_us: Didn't it equal telling him to send his men off to die? This kind of thing was nice to say, but the problem was that there was absolutely no way to implement it.

source: 不是说要把小乌龟交给他们，怎么借口还是跟之前说的一样，难道……凌霄该不会真的听他的话想把小乌龟留给他吧？
en_us: Didn't he say to pass the baby turtle to them? Why was his excuse the same as the one he used before? Don't tell me that.. Ling Xiao was really going listen to his words and leave the baby turtle to him?

source: 不止是他，夏音和万俟西元的表情也有些错愕，他们根本没看到凌霄有什么大的动作，以斗篷人的实力，不可能这么轻易就化解他的力量。
en_us: Not only he, but Xia Yin and MoQi XiYuan were also somewhat startled. They did not see any big movements from Ling Xiao at all. Based off the strength of the cloaked man, it was impossible to neutralize his strength so easily.

source: 不止游小默皱起眉。
en_us: It wasn’t just You XiaoMo who frowned at that.

source: 不用夏音说，斗篷人和万俟西元也注意到这一点。
en_us: Even without Xia Yin saying it, both the man-in-hood (斗篷人) and MoQi XiYuan noticed it as well.

source: 不用看，两站小嘴巴一定肿了。
en_us: Even without checking, he knew their mouth would be swollened.

source: 不知从什么时候开始，据说传承突然就断了，之后传族之宝便从一件逆天宝贝变成家主的信物，再也没有人知道它有什么功能。
en_us: It was unknown when this tradition was suddenly broken. Afterwards, the Inheritance Jewel changed from a treasure that defied the natural order to a symbol of the Family Head and never was there anyone who knew of its capabilities.

source: 不知是谁在中间推波助澜，消息传得很快，连同他们住在哪间酒楼都被传出去了。
en_us: Who knew who was in the center of it all adding fuel to the fire, but the news spread extremely fast, and even what inn they were staying at was leaked out.

source: 不知过了多久，一个尖锐的声音骤然响起，片刻后，好像有一个大泡沫被戳破一样，发出‘啵’的声响，然后就是一阵山摇地动，奔腾的海啸从四面八方涌进来……
en_us: After who knows how long, a sharp noise suddenly screeched through the air. There was a pause before there was a loud pop, like a bubble being burst. Then, the ground quaked and the sea flooded in from all directions.

source: 不知道为什么，游小默突然有种看到自己克隆版的奇妙感觉，为什么他会觉得很欠扁呢？
en_us: He didn't know why, but You XiaoMo suddenly had an intriguing feeling that it was almost as if he was looking at his own clone. Why did he think it felt so annoying?

source: 不知道真相的他只能默默的为儿子保密，在他眼里，儿子做错了那也必须是对的。
en_us: He didn't know the truth, and could only silently keep the secret for his son. In his eyes, even if his son did something wrong, it would still have to be right.

source: 不知道能不能换？
en_us: He wondered if he could make a trade?

source: 不等凌霄有所动作，另一股不输于游震天的其实在他们身旁冲天而起，在半空中将游震天的气势攻击截了下来，两股气势让拍卖会场的人感觉到一股难受的压迫感。
en_us: Without waiting for Ling Xiao's reaction, another aura which did not lose out to You ZhenTian burst out from beside them, intercepting the aura attack of You ZhenTian in mid-air. The pressure from two auras made the people at the auction feel an uncomfortable sense of oppression.

source: 不给游小默喘息的机会，独眼刀疤身上激发出一股强大的爆发力，以更快的速度和冲击力瞬间出现在游小默面前，挥舞的长刀以破开山河之势朝游小默头顶砍了下去。
en_us: Without giving You XiaoMo the chance to rest, One-Eyed Scarface suddenly gained an explosive increase in power, appearing in front of You XiaoMo at an even faster speed and momentum, his sword swing down at You XiaoMo's head with a mountain-splitting power.

source: 不要以为他不知道凌霄在想什么，这货绝对在想小木屋的活春宫，但是条件不允许，因为附近都是住户，他自己的空间又有白衣人，于是乎，想去他的空间办事么，门儿都没有！
en_us: Don't think he doesn't know what Ling Xiao was thinking. That asshole was definitely thinking of what was happening in that hut. But since circumstances prevented it, what with their current surroundings, their dimensions were left empty and therefore, free game. He knew what Ling Xiao wanted them to do in their dimension. There was no way he'd let him!

source: 不要怪她卑鄙，他们本来就是敌人，只要能赢，任何手段她都会去做，而且说不定游小默身上还有灵水，所以她绝对不愿意在大庭广众之下输给游小默。
en_us: Don’t blame her for playing dirty, they were enemies. To assure her victory, she would be willing to play dirty any time. Plus, You XiaoMo might have more spiritual water on him, so she was definitely unwilling to lose to him in public.

source: 不认识人家不代表没眼光，当他发现他看不透凌霄的修为后，他就察觉到不对劲。
en_us: Just because he didn't know them, doesn't mean he didn't have eyes. Once he realized that he couldn't tell Ling Xiao's level, he knew something was wrong.

source: 不论是夏音，还是万俟西元和斗篷人，他们都对独立空间很有兴趣，可是独立空间只有一个……
en_us: No matter who it was, they were very interested in the independent dimension, however, there was only one...

source: 不论是酒楼里还是外面围观的人。
en_us: Both from the people inside the inn and outside watching.

source: 不说话我就当你同意了，取什么名字好呢？”
en_us: If you don't speak up, I'll take it as you agreeing. What name should I give you ne?"

source: 不过为了让遇袭事件更逼真，她让小秋假死，化身为另一名女侍，然后才派人将消息带回古玛部落。
en_us: However, to make the story of the attack more realistic, she had Xiao Qiu feign her death and become a different attendant before sending someone to report back to the Guma Tribe.

source: 不过——
en_us: However -

source: 不过……
en_us: However... ...

source: 不过万俟西元担心他的儿子进去后会遇到危险，所以派了个人在这里等他们，虽然没有圣境修为，但是也有神境四星，那个人本来就有名额，所以不用多久，三人便进去了。
en_us: However, in fear of the dangers his son might face, MoQi XiYuan left a person here waiting for them. Although, he wasn't at the Sacred Realm, he was a four star Divine Realm practitioner, who already had a spot in the exploration. So, it didn't take long before the three of them entered.

source: 不过三品到四品之间所需要的能量比他想象的还要多。
en_us: However, the energy required to go from three stars (三品) to four stars was more than he had imagined.

source: 不过不代表其他人就没事。
en_us: But that didn't mean that the others weren't having trouble.

source: 不过与此同时，拍卖师的晶石板也变换了信息，看到价格不禁怔愣了一下，旋即高声宣布道：“十四号出价两亿五千万灵晶，还有没有更高的？”
en_us: But at the same time, the auctioneer's spirit gem board changed its information. When he saw the price, he couldn't help but be stunned for a moment before he instantly announced loudly, "Number fourteen offers a price of 250 million spirit gems, will anyone go even higher?"

source: 不过两个月足够磨掉苏朗为数不多的耐心，所以这次他没有派人打听他们的行踪，也就没能第一时间知道他的目标已经到乌山集镇。
en_us: However, two months was enough to use up Su Lang's rather lacking patience. Thus, he didn't send anyone to check on their movements this time, so he didn't get the news of their arrival in WuShan Town immediately.

source: 不过为了不引起滕家的人怒火，他牺牲了一半的柴家人。
en_us: But to avoid the Teng family’s anger, he sacrificed half of the Chai family members, too.

source: 不过为了炼一枚心脉丹，他也没心思再去森林里抓红冠鸡。
en_us: However, in order to refine a Heart Vein Pill (心脉丹), he had no interest in going back to the forest to catch the Red-Crowned Turkey.

source: 不过为什么他就是游兄弟，而凌霄就是凌兄？
en_us: However, why was he only Fellow Brother You, but Ling Xiao was Brother Ling?

source: 不过也幸好他缩回去了，因为凌霄眼睛里流露出的淡淡笑意被姬芮发现，下一秒她几乎是警觉的往门口看过去，不过她只看到一群围观的路人甲乙丙。
en_us: Good thing he did too, because the a slight 'laugher' escaped Ling Xiao's eyes (流露出的淡淡笑意) and was discovered by Ji Rui. Instantly she looked over to the door in alarm but all she saw was a bunch of bystanders.

source: 不过也有人在讨论洞城的事情。
en_us: However, there were also people discussing what happened in Dong Yu.

source: 不过也正因如此，游小默才确定这个黑衣人是因为峡谷下面的东西才会偷袭他，而且他应该是个职业的，身份类似杀手的人，因为只有杀手才会极力的隐瞒自己的身份。
en_us: But, it was because of this that You XiaoMo was sure the man attacked him because there was something below the canyon. He's probably also a professional assassin, so something like it, as they are the only ones who would hid their identity.

source: 不过也难怪，乾坤丹的价值比一般彩丹要强得多，能够激发潜力，还能晋级，简直就是一石二鸟。
en_us: However, it was not surprising as the value of the Cosmos Pill was much more than an ordinary rainbow pill. It could stimulate the latent potential and even lead to advancement and was practically just like killing two birds with one stone.

source: 不过他一个人要把所有的才端回去有点麻烦。
en_us: However, it would be a little troublesome to take all the dishes back himself.

source: 不过他们并不知道，滕梓心的六级中品灵丹，实际上是下品，只不过她用了灵水，所以将灵丹的档次提高了，变成中品，这种例子虽然少，但不是不可能。
en_us: What they didn’t know was that Teng ZiXin’s pill was actually low grade, but she used spiritual water to improve the grade of her pill to mid. Though this wasn’t common, it wasn’t impossible either.

source: 不过他们并没有停留，而是直接离开。
en_us: However, they directly left the town instead of stopping over.

source: 不过他们没有到上面，而是在灵山半山腰找了一座已经被光顾过的洞府。
en_us: But instead of going to the top, they found an Immortal’s Cave halfway up the spirit mountaint hat had already been used.

source: 不过他们没有立刻离开苍盟势力的覆盖范围，而是去找银戈，风迟云身上被下了奇怪的东西，银戈和展雨轩没办法解开，为了等他们，三人在一个隐蔽的小村庄等了两天。
en_us: However, they did not leave the coverage area of the Cang Alliance immediately, rather they went to find Yin Ge. Something strange had been done to Feng ChiYun's body. Yin Ge and Zhan YuXuan could not undo it. The three people were hid in small village and waited two days in order to meet them.

source: 不过他们能知道这件事，其他势力也应该收到消息了。
en_us: But they since they knew about this, the other fractions should also have received this information.

source: 不过他和青年约定，等离开遗迹后，他会去找他，因此让他准备好妖兽的内丹，他要的可不是一颗两颗的量。
en_us: However, they had made an agreement with the youth that after leaving the ruins, they would go find him, and so they told him to prepare the demon beast Life Crystals. What they needed wasn't just one or two.

source: 不过他就知道天心大小姐的自尊心一定很强，被他拒绝了大概面子上觉得过不去，所以才会说这些话反驳他，幸亏他早有心理准备。
en_us: However, he knew of Tian Xin's pride and sense of dignity. She probably felt that his rejection would lose her face, so used this to retort. It was good that he had been prepared.

source: 不过他猜不到凌霄心里的想法，只好抱着一肚子疑惑在傍晚来临的时候和他一起前往小港口。
en_us: However, he could only head for the small port together with him when evening approached, carrying a bellyful of doubts as he could not guess what Ling Xiao was thinking.

source: 不过他现在却更加迫切想回到地球那个低阶位面，他想知道游家到底有什么他不知道的秘密。
en_us: However, he was even more anxious to return to Earth in the Lower Level Realm now. He wanted to know what secrets the You family had that he was unaware of.

source: 不过他的想法并未立刻传达给唐赫和唐中华。
en_us: However, Tang ZhongHua and Tang He didn't immediately understand what he was thinking of.

source: 不过他看到吞金兽和两只金翅虫的时候，表情像吃了屎一样。
en_us: However, he looked like he had just eaten shit when he saw the Metal Swallowing Beast and the Golden Winged Insects.

source: 不过他第一次听说有正门不直走偏要去闯的。
en_us: However, this was the first time he had herad of someone who refused to walk the easy path and chose to brute force their way through instead.

source: 不过他耳力很不错，那些人小声讨论的声音顿时被他听得一清二楚，大意都是‘穿得这么好，一定是外来者’、‘最近的外来者怎么这么多’、‘来了一个又一个’等等内容。
en_us: However, he had pretty good hearing, and he could hear the whispers clear as day. He got the gist of it: 'they're dressed so well, they must be outsiders', 'how come there've been so many outsiders recently', 'they're coming one after the other' and whatnot.

source: 不过他能躲过多扩是在海里，海水虽然无法扑灭神火，但多少对神火有些阻力，正是这点差距才让他躲过一劫。
en_us: But the main reason why he could dodge it was because they were in the ocean. Although the ocean couldn't extinguish Godfire, it could obstruct the Godfire a little bit. It was this tiny difference that allowed him avoid disaster.

source: 不过他要怎么做才能让莫菲看不出来，这个时候，谢俊已经把主意打到莫菲身上，不过很快他就不用烦恼了。
en_us: But, now he needed to prevent Mo Fei from seeing this side of him. At this moment, he had already changed to focus on Mo Fei instead, but he would soon be rid of his worries.

source: 不过他认为凌霄能接下他这一拳，想必是用了九成或十成的实力，接下来就没那么好运气了。
en_us: However, he believed that in order for Ling Xiao to receive this fist of his, he must have used up at least 90% or 100% of his strength. He wouldn't be so fortunate after this.

source: 不过以前的游族并不叫赤血家族，也没有分那么多旁枝，不论是否正统，全部统称游族。
en_us: However, the You Family was not called the Vermillion Blood Clan before and didn't have that many side families (旁枝). Regardless of their legitimacy (正统), they were all considered as part of the You Family.

source: 不过任谁看到自家人被自己最讨厌的人干掉，恐怕都很难镇定得下来。
en_us: No matter who it was, they would probably be unable to remain calm after seeing their family members get their asses kicked by the person they hated.

source: 不过倒是苦了其他外来者，因为他们被及就诊的人排斥的更厉害了，现在就是有灵晶他们也不给买，有些人受不了这里的氛围，当天就离开了。
en_us: However, this had hindered the other outsiders, because the locals started ostracizing them even more. Now, even if they had spirit gems, no one would be willing to sell anything. Some couldn't bare this kind of atmosphere and left directly.

source: 不过再谨慎还是在融合的时候出现一个小失误，花了三天提炼出来的灵草就这么功亏一篑了。
en_us: However, no matter how careful he was, when he was combining everything, there was a small mistake and the three days he spent extracting herbs were wasted.

source: 不过准确来说，整个宫殿的地面其实都是玉床那种乳白色晶矿构成的，只不过其他地方被白虎巧妙的掩盖掉了，所以别人就以为只有主殿的地板是那种晶矿构成的。
en_us: But, in reality, the entire palace's floors were made of the same milky white crystal as the jade bed. It was just that in other places, the White Tiger and cleverly covered it up, so others would think that only the main hall had floors made of that material.

source: 不过凌霄并不放心他一个人留在这里，毕竟现在大家都在找洞府，要是有哪个不长眼的找到这里来，打扰到修炼那就麻烦了。
en_us: However, Ling Xiao felt worried about leaving him here alone. After all, everyone was looking for am Immortal’s Cave now. It would be troublesome if some careless person (哪个不长眼的) found this place and disturbed his cultivation.

source: 不过凌霄并不认为这里只有水元素之心最珍贵。
en_us: However, Ling Xiao did not think that the most precious thing here was the Water Elemental Essence.

source: 不过凌霄并没有去过鬼哭涯，第一次来的时候，他是提前通知那个人，然后和他在另一个地方见的面，因此就连凌霄也不知道鬼哭涯在哪里，天狗到底有多少个成员。
en_us: However, Ling Xiao had never been to the Weeping Ghost Shore. He informed that person in advance the first time he came, and then met with him in another location. Therefore, Ling Xiao did not know where the Weeping Ghost Shore was and how many members were in Tiangou.

source: 不过凌霄并没有立刻回答他的问题，而是拉着他往回走。
en_us: However, Ling Xiao didn't answer his question immediately. Instead, he started dragging him back in the direction they came from.

source: 不过凌霄没有就此罢手，一道龙吟犹如冲击波般响彻云霄，惊醒了无数栖息在山峰之上的黑鸦，嘎嘎嘎的从山上掉下来。
en_us: However, Ling Xiao did not stop there. A dragon cry similar to a shock wave resounded in the skies, rousing innumerable black crows that were perching on the peak, and they cawed as they fell off the mountain.

source: 不过凌霄确实打定主意要送走小黑，皮球和毛球。
en_us: However, Ling Xiao was set on sending away XiaoHei, PiQiu and MaoQiu.

source: 不过凡事不是绝对的，所以银戈现在要做的，就是趁这段时间将风迟云带得越远越好。
en_us: However, not everything was absolute. Therefore, what Yin Ge had to do now was to take advantage of this period of time to bring Feng ChiYun as far away as possible.

source: 不过十二阶水妖显然不准备先把注意力给他们，它的目光很快便落在离它最近的江流身上。
en_us: However, the Level Twelve Water Demon was obviously not ready to give them its attention, and its eyes soon fell on Jiang Liu who was the nearest to it.

source: 不过在桃源就算是一个小型洞府，外面也布置着几层禁制，有的甚至还有高阶妖兽看守，凶猛的妖兽阻碍了不少人，但仍然阻挡不了大家对灵丹的热情。
en_us: But even if the Peach Blossom Ruins were just a small (洞府), there was a few layers of restrictions on the outside and even some high tier demon beasts as guards. The ferociousness of the demon beast deterred some people, but wasn't enough for everyone's love of magic pills.

source: 不过多了一只水妖确实对他们形成一些阻力，那只十二阶水妖战力突然飙升，攻击犀利了许多，真龙族的强者为了牵制住十一阶水妖反而把自己弄得抽不开身，结果十二阶水妖的压力就全压在丹师工会的强者身上。
en_us: However, an additional Water Demon did give them some opposition. The fighting strength of the Level Twelve Water Demon suddenly soared and its attacks became much sharper. In order to restrain the Level Eleven Water Demon, the expert from the True Dragon Clan had to fully concentrate on it. As a result, the pressure of fighting the Level Twelve Water Demon fell entirely on the expert from the Mage Association.

source: 不过夜明珠一出，山洞就被照得仿若白昼。
en_us: But once the Night Pearl was taken out, the cave was lit up so brightly as if it was daytime.

source: 不过大概是以前他宰得太过头了，宰出点名声，所以这个月摆了三天都没有人上门，现在好不容易逮到一只肥羊，心里总想着下次可能没这么好运，所以就忍不住狮子大开口，岂料对方竟然是个不肯吃亏的主，而且连一点面子也不给他。
en_us: Perhaps because he had ripped people off excessively, he became known for marking up his prices, so no one came to his shop despite him being open for three days this month. Now that he had finally managed to catch a fat sheep, he repeatedly worried that he might not be so lucky next time and could not resist demanding an exorbitant price (狮子大开口). How could he have expected that the other party would be one who refused to suffer losses and not even give him a little face?

source: 不过天狗的成员并没有看到凌霄和游小默，本事再大，也不可能穿透重重叠叠的山峰看到站在山脚下的他们。
en_us: However, the members of the Tengu did not catch sight of Ling Xiao and You XiaoMo. No matter how skilled they were, it was impossible to look through the overlapping (重重叠叠) mountain peaks and see the two standing at the foot of the mountain.

source: 不过她能想到，别人未必想不到。
en_us: But what she thought of, others may not have not realized it.

source: 不过实力毕竟相差太大，在游震天的注视下，江流的身体还是微微抖了起来，半晌才听到他的声音。
en_us: However, the difference in their power was still significant and Jiang Liu began to tremble under You ZhenTian's gaze. There was a small pause before the other spoke up.

source: 不过对于圣境强者，这里却是收取空间之力的好地方。
en_us: But for the Sacred Realm experts, this was a good place to accumulate spacial energy.

source: 不过少了天明帮忙牵制，他就手忙脚乱起来，眼前白影一闪，耳旁响起一道细细的风啸声，天恨下意识用手去挡，虽然挡住了，但是对方一脚踢在他手臂上，整个人霎时翻了出去，摔在天明身旁。
en_us: However, he began getting in a fluster without Tian Ming helping to pin the man down. A white figure flashed before his eyes and the faint whistle of wind sounded beside his ear. Tian Hen subconsciously used his hand to block it, but the other party's kick landed on his arm and his entire body flipped over in a flash, falling beside Tian Ming.
